Repository: Pazzword/Django-Painter-sWeb
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, fr, ru

source: Bio
de: Biografie
fr: Biographie
ru: Биография

source: Where Art Meets Emotion, and Every Stroke Tells a Story.
de: Wo Kunst auf Emotionen trifft und jeder Strich eine Geschichte erzählt.
fr: Où l'art rencontre l'émotion, et chaque coup de pinceau raconte une histoire.
ru: Там, где искусство встречает эмоции, а каждый штрих рассказывает историю.

source: Abu Pashaev, born in 1966 in Chechen-Aul, is a distinguished artist whose life journey shapes his profound creations. From serving in the Soviet Army to graduating in graphic design, Pashaev's diverse experiences manifest in his artwork. Seeking guidance from renowned Chechen artists and integrating martial arts philosophy, he crafted his style, 'Wind.' His graphic series, like 'You Don't Know How Painful It Is!,' explores inner worlds with titles such as 'Scream' and 'Apocalypse.' Pashaev's works express universal themes of pain, solitude, and the human condition, showcasing his ability to convey deep emotions through a meticulous artistic process. His inaugural exhibition, 'Atomic Heart of My Mom' (1992), marked the beginning of a significant artistic journey. Abu Pashaev emerges as an artist whose profound expressions resonate with the complexities of human existence.
de: Abu Pashaev, geboren 1966 in Tschetschen-Aul, ist ein angesehener Künstler, dessen Lebensweg seine tiefgründigen Werke prägt. Vom Dienst in der Sowjetarmee bis zum Abschluss in Grafikdesign, Pashaevs vielfältige Erfahrungen manifestieren sich in seiner Kunst. Unter der Anleitung renommierter tschetschenischer Künstler und der Integration der Kampfkunstphilosophie entwickelte er seinen Stil 'Wind'. Seine Grafikserien, wie 'Du weißt nicht, wie schmerzhaft es ist!', erforschen innere Welten mit Titeln wie 'Schrei' und 'Apokalypse'. Pashaevs Werke drücken universelle Themen wie Schmerz, Einsamkeit und die menschliche Natur aus und zeigen seine Fähigkeit, tiefe Emotionen durch einen sorgfältigen künstlerischen Prozess zu vermitteln. Seine erste Ausstellung, 'Atomisches Herz meiner Mutter' (1992), markierte den Beginn einer bedeutenden künstlerischen Reise. Abu Pashaev tritt als Künstler hervor, dessen tiefgründige Ausdrucksweise mit den Komplexitäten der menschlichen Existenz resoniert.
fr: Abu Pashaev, né en 1966 à Chechen-Aul, est un artiste distingué dont le parcours de vie façonne ses créations profondes. Du service dans l'armée soviétique à l'obtention d'un diplôme en design graphique, les expériences variées de Pashaev se manifestent dans son œuvre. En cherchant l'orientation d'artistes tchétchènes renommés et en intégrant la philosophie des arts martiaux, il a créé son style, 'Vent'. Sa série graphique, comme 'Vous ne savez pas combien c'est douloureux !', explore les mondes intérieurs avec des titres tels que 'Cri' et 'Apocalypse'. Les œuvres de Pashaev expriment des thèmes universels de la douleur, de la solitude et de la condition humaine, montrant sa capacité à transmettre des émotions profondes à travers un processus artistique minutieux. Son exposition inaugurale, 'Le cœur atomique de ma mère' (1992), a marqué le début d'un voyage artistique significatif. Abu Pashaev émerge comme un artiste dont les expressions profondes résonnent avec les complexités de l'existence humaine.
ru: Абу Пашаев, родившийся в 1966 году в Чечен-Ауле, - выдающийся художник, чья жизненная дорога формирует его глубокие творения. От службы в Советской Армии до окончания учебы по графическому дизайну, разнообразные опыты Пашаева находят отражение в его произведениях. Ища наставления у известных чеченских художников и интегрируя философию боевых искусств, он разработал свой стиль 'Ветер'. Его графические серии, такие как 'Ты не знаешь, как больно это!', исследуют внутренние миры с названиями, такими как 'Крик' и 'Апокалипсис'. Работы Пашаева выражают универсальные темы боли, одиночества и человеческой природы, демонстрируя его способность передавать глубокие эмоции через тщательный художественный процесс. Его первая выставка, 'Атомное сердце моей мамы' (1992), ознаменовала начало значительного художественного пути. Абу Пашаев является художником, чьи глубокие выражения резонируют с сложностями человеческого существования.

source: The artist's series of works, titled 'Esoteric Perspective on Ancestral Symbols,' is a profound exploration inspired by their late mentor, Vsevolod Semenych Grygoriev. Rooted in the artist's journey of self-discovery during the early 90s, these pieces reflect their deep immersion in avant-garde movements, particularly surrealism, as they sought to articulate their unique vision through art.
de: Die Werkserie des Künstlers mit dem Titel 'Esoterische Perspektive auf Ahnensymbole' ist eine tiefgründige Erforschung, inspiriert von ihrem verstorbenen Mentor Vsevolod Semenych Grygoriev. Verwurzelt in der Selbstfindungsreise des Künstlers in den frühen 90er Jahren, spiegeln diese Stücke ihr tiefes Eintauchen in avantgardistische Bewegungen wider, insbesondere den Surrealismus, während sie versuchten, ihre einzigartige Vision durch Kunst auszudrücken.
fr: La série d'œuvres de l'artiste, intitulée 'Perspective ésotérique sur les symboles ancestraux', est une exploration profonde inspirée par leur défunt mentor, Vsevolod Semenych Grygoriev. Ancrées dans le parcours de découverte de soi de l'artiste au début des années 90, ces pièces reflètent leur immersion profonde dans les mouvements d'avant-garde, en particulier le surréalisme, alors qu'ils cherchaient à articuler leur vision unique à travers l'art.
ru: Серия работ художника под названием 'Эзотерическая перспектива на символы предков' — это глубокое исследование, вдохновлённое их покойным наставником, Всеволодом Семёновичем Григорьевым. Коренясь в пути художника к самооткрытию в начале 90-х, эти произведения отражают его глубокое погружение в авангардные движения, особенно сюрреализм, в стремлении выразить своё уникальное видение через искусство.

source: Drawing from their academic background in graphic design at the Chechen State Pedagogical Institute, the artist received pivotal guidance from Grygoriev, a seasoned artist with a rich theatrical background. Under Grygoriev's mentorship, the artist gained insights into the transformative impact of artists like Salvador Dalí, who infused surrealism with their distinct worldview, shaping the artistic landscape of both the West and Europe.
de: Aufbauend auf ihrem akademischen Hintergrund in Grafikdesign am Tschetschenischen Staatlichen Pädagogischen Institut erhielt der Künstler entscheidende Anleitung von Grygoriev, einem erfahrenen Künstler mit reichem theatralischem Hintergrund. Unter Grygorievs Mentorschaft erhielt der Künstler Einblicke in die transformative Wirkung von Künstlern wie Salvador Dalí, die den Surrealismus mit ihrer einzigartigen Weltanschauung durchdrangen und die künstlerische Landschaft sowohl des Westens als auch Europas prägten.
fr: Tirant parti de leur formation académique en design graphique à l'Institut pédagogique d'État tchétchène, l'artiste a reçu des conseils cruciaux de Grygoriev, un artiste chevronné avec un riche background théâtral. Sous la tutelle de Grygoriev, l'artiste a acquis des connaissances sur l'impact transformateur d'artistes comme Salvador Dalí, qui ont infusé le surréalisme avec leur vision du monde distincte, façonnant le paysage artistique de l'Occident et de l'Europe.
ru: Опираясь на своё академическое образование в области графического дизайна в Чеченском государственном педагогическом институте, художник получил ключевые наставления от Григорьева, опытного художника с богатым театральным прошлым. Под руководством Григорьева художник получил представление о трансформирующем воздействии таких художников, как Сальвадор Дали, которые наполнили сюрреализм своим уникальным мироощущением, формируя художественный ландшафт как Запада, так и Европы.

source: Encouraged by Grygoriev to incorporate elements of national ethnicity into their work, the artist embarked on a creative journey marked by profound symbolism and cultural significance. Each piece in the series reflects a meticulous fusion of artistic expression and ancestral heritage, aimed at capturing the essence of the human experience.
de: Von Grygoriev ermutigt, Elemente der nationalen Ethnizität in ihre Arbeit einzubeziehen, begab sich der Künstler auf eine kreative Reise, die von tiefgründigem Symbolismus und kultureller Bedeutung geprägt war. Jedes Stück in der Serie spiegelt eine sorgfältige Verschmelzung von künstlerischem Ausdruck und dem Erbe der Vorfahren wider, mit dem Ziel, das Wesen der menschlichen Erfahrung einzufangen.
fr: Encouragé par Grygoriev à intégrer des éléments de l'ethnicité nationale dans leur travail, l'artiste a entrepris un voyage créatif marqué par un symbolisme profond et une signification culturelle. Chaque pièce de la série reflète une fusion méticuleuse de l'expression artistique et de l'héritage ancestral, visant à capturer l'essence de l'expérience humaine.
ru: По совету Григорьева, включившего элементы национальной этнической культуры в своё творчество, художник отправился в творческое путешествие, отмеченное глубоким символизмом и культурным значением. Каждое произведение в серии отражает тщательное слияние художественного выражения и предковской наследственности, направленное на запечатление сущности человеческого опыта.

source: Pashaev's works express universal themes of pain, solitude, and the human condition, showcasing his ability to convey deep emotions through a meticulous artistic process.
de: Pashaevs Werke drücken universelle Themen wie Schmerz, Einsamkeit und die menschliche Natur aus und zeigen seine Fähigkeit, tiefe Emotionen durch einen sorgfältigen künstlerischen Prozess zu vermitteln.
fr: Les œuvres de Pashaev expriment des thèmes universels de la douleur, de la solitude et de la condition humaine, montrant sa capacité à transmettre des émotions profondes à travers un processus artistique minutieux.
ru: Работы Пашаева выражают универсальные темы боли, одиночества и человеческой природы, демонстрируя его способность передавать глубокие эмоции через тщательный художественный процесс.

source: His inaugural exhibition, 'Atomic Heart of My Mom' (1992), marked the beginning of a significant artistic journey. Abu Pashaev emerges as an artist whose profound expressions resonate with the complexities of human existence.
de: Seine erste Ausstellung, 'Atomisches Herz meiner Mutter' (1992), markierte den Beginn einer bedeutenden künstlerischen Reise. Abu Pashaev tritt als Künstler hervor, dessen tiefgründige Ausdrucksweise mit den Komplexitäten der menschlichen Existenz resoniert.
fr: Son exposition inaugurale, 'Le cœur atomique de ma mère' (1992), a marqué le début d'un voyage artistique significatif. Abu Pashaev émerge comme un artiste dont les expressions profondes résonnent avec les complexités de l'existence humaine.
ru: Его первая выставка, 'Атомное сердце моей мамы' (1992), ознаменовала начало значительного художественного пути. Абу Пашаев — художник, чьи глубокие выражения резонируют с сложностями человеческого существования.

source: In this artwork, one encounters a depiction from the series 'An Esoteric Perspective on Ancestral Symbols', specifically the right part of the triptych. It portrays a figure resembling a thinker, with the wing of a bird and a lowered hand, as if supporting a fragment of a mountain where a tower stands, alongside a flying winged sun disk. The scene invites contemplation through time and space of the origins of the depicted character's ancestors, the Sumerians and the Hurrians, representing a civilization that has faded into history. As an artist chronicler, the piece reflects a dreamlike vision, with signs resembling imprints suspended in the air, carrying cryptic information that eludes understanding, leaving viewers only able to speculate. This artwork serves as a metaphorical journey of self-discovery...
de: In diesem Kunstwerk begegnet man einer Darstellung aus der Serie 'Eine esoterische Perspektive auf Ahnensymbole', speziell dem rechten Teil des Triptychons. Es zeigt eine Figur, die einem Denker ähnelt, mit dem Flügel eines Vogels und einer gesenkten Hand, als würde sie ein Fragment eines Berges stützen, auf dem ein Turm steht, neben einer fliegenden geflügelten Sonnenscheibe. Die Szene lädt zur Kontemplation über Zeit und Raum hinweg über die Ursprünge der dargestellten Vorfahren der Sumerer und Hurrier ein, die eine Zivilisation darstellen, die in die Geschichte eingegangen ist. Als künstlerischer Chronist reflektiert das Stück eine traumähnliche Vision, mit Zeichen, die wie im Raum schwebende Abdrücke wirken, die kryptische Informationen tragen, die dem Verständnis entgehen und die Betrachter nur spekulieren lassen. Dieses Kunstwerk dient als metaphorische Reise zur Selbstfindung...
fr: Dans cette œuvre, on rencontre une représentation de la série 'Une perspective ésotérique sur les symboles ancestraux', spécifiquement la partie droite du triptyque. Elle dépeint une figure ressemblant à un penseur, avec l'aile d'un oiseau et une main abaissée, comme si elle soutenait un fragment de montagne où se dresse une tour, aux côtés d'un disque solaire ailé volant. La scène invite à la contemplation à travers le temps et l'espace des origines des ancêtres du personnage représenté, les Sumériens et les Hourrites, représentant une civilisation qui a disparu dans l'histoire. En tant que chroniqueur artistique, la pièce reflète une vision onirique, avec des signes ressemblant à des empreintes suspendues dans les airs, portant des informations cryptiques qui échappent à la compréhension, laissant les spectateurs uniquement capables de spéculer. Cette œuvre sert de voyage métaphorique de découverte de soi...
ru: В этом произведении изображена работа из серии 'Эзотерическая перспектива на символы предков', конкретно правая часть триптиха. Оно изображает фигуру, напоминающую мыслителя, с крылом птицы и опущенной рукой, как будто поддерживающей фрагмент горы, на которой стоит башня, рядом с летящим крылатым солнечным диском. Сцена приглашает к созерцанию сквозь время и пространство происхождения предков изображённого персонажа, шумеров и хурриков, представляющих цивилизацию, которая исчезла в истории. Как художник-хроникёр, произведение отражает мечтательное видение, с признаками, напоминающими отпечатки, висящие в воздухе, содержащие криптическую информацию, ускользающую от понимания, оставляя зрителей только догадываться. Это произведение служит метафорическим путешествием самопознания...

source: Art Exhibitions
de: Kunstausstellungen
fr: Expositions d'Art
ru: Выставки Искусства

source: Atomic Heart of My Mom
de: Atomisches Herz meiner Mutter
fr: Le cœur atomique de ma mère
ru: Атомное сердце моей мамы

source: Grozny, Russia
de: Grosny, Russland
fr: Grozny, Russie
ru: Грозный, Россия

source: Premonition of the Civil War
de: Vorahnung des Bürgerkriegs
fr: Prémonition de la guerre civile
ru: Предчувствие Гражданской войны

source: Silent Protest Against Violence
de: Stiller Protest gegen Gewalt
fr: Protestation silencieuse contre la violence
ru: Молчаливый протест против насилия

source: Chechen-Aul, Russia
de: Tschetschen-Aul, Russland
fr: Chechen-Aul, Russie
ru: Чечен-Аул, Россия

source: Wounded Flowers
de: Verwundete Blumen
fr: Fleurs blessées
ru: Раненые цветы

source: The Face of War
de: Das Gesicht des Krieges
fr: Le visage de la guerre
ru: Лицо войны

source: Nazran, Russia
de: Nazran, Russland
fr: Nazran, Russie
ru: Назрань, Россия

source: Prague, Czech Republic
de: Prag, Tschechische Republik
fr: Prague, République tchèque
ru: Прага, Чехия

source: Optimistic Reflection of the Past
de: Optimistische Reflexion der Vergangenheit
fr: Réflexion optimiste sur le passé
ru: Оптимистичное отражение прошлого

source: Peace to the Caucasus
de: Frieden für den Kaukasus
fr: Paix au Caucase
ru: Мир Кавказу

source: Sochi - 2008
de: Sotschi - 2008
fr: Sotchi - 2008
ru: Сочи - 2008

source: Sochi, Russia
de: Sotschi, Russland
fr: Sotchi, Russie
ru: Сочи, Россия

source: Chechen Artists at the State Duma
de: Tschetschenische Künstler in der Staatsduma
fr: Artistes tchétchènes à la Douma d'État
ru: Чеченские художники в Государственной Думе

source: Moscow, Russia
de: Moskau, Russland
fr: Moscou, Russie
ru: Москва, Россия

source: Artists from the Chechen Republic
de: Künstler aus der Tschetschenischen Republik
fr: Artistes de la République tchétchène
ru: Художники из Чеченской Республики

source: Saratov City Duma, Russia
de: Stadtduma Saratow, Russland
fr: Douma de la ville de Saratov, Russie
ru: Саратовская городская дума, Россия

source: Apotheosis of History (with V.V. Zauraev)
de: Apotheose der Geschichte (mit V.V. Zauraev)
fr: Apothéose de l'histoire (avec V.V. Zauraev)
ru: Апофеоз истории (с В.В. Заураевым)

source: Scream in Art
de: Schrei in der Kunst
fr: Cri dans l'art
ru: Крик в искусстве

source: Maykop, Russia
de: Maikop, Russland
fr: Maïkop, Russie
ru: Майкоп, Россия

source: Zonal Exhibition
de: Zonenausstellung
fr: Exposition zonale
ru: Зональная выставка

source: Rostov-on-Don, Russia
de: Rostow am Don, Russland
fr: Rostov-sur-le-Don, Russie
ru: Ростов-на-Дону, Россия

source: VIII International Art Symposium 'Tales of Love'
de: VIII. Internationales Kunstsymposium 'Erzählungen der Liebe'
fr: VIII Symposium international d'art 'Contes d'amour'
ru: VIII Международный художественный симпозиум 'Сказания о любви'

source: Yelabuga, Russia
de: Jelabuga, Russland
fr: Elabouga, Russie
ru: Елабуга, Россия

source: Hand in Art
de: Hand in der Kunst
fr: Main dans l'art
ru: Рука в искусстве

source: XI Regional Exhibition 'Southern Russia'
de: XI. Regionale Ausstellung 'Südrussland'
fr: XI Exposition régionale 'Russie du Sud'
ru: XI Региональная выставка 'Южная Россия'

source: Website Title
de: Webseitentitel
fr: Titre du site web

source: MAIN
de: HAUPTSEITE
fr: PRINCIPAL
ru: ГЛАВНАЯ

source: BIOGRAPHY
de: BIOGRAFIE
fr: BIOGRAPHIE
ru: БИОГРАФИЯ

source: GALLERY
de: GALERIE
fr: GALERIE
ru: ГАЛЕРЕЯ

source: Value creation
de: Wertschöpfung
fr: Création de valeur
ru: Создание ценности

source: Sections
de: Abschnitte
ru: Разделы

source: Home
de: Startseite
fr: Accueil
ru: Главная

source: Biography
de: Biografie
fr: Biographie
ru: Биография

source: Gallery
de: Galerie
fr: Galerie
ru: Галерея

source: Social
de: Soziale Medien
ru: Социальные сети

source: Follow us on Facebook
de: Folgen Sie uns auf Facebook
fr: Suivez-nous sur Facebook
ru: Подписывайтесь на нас в Facebook

source: Follow us on Instagram
de: Folgen Sie uns auf Instagram
fr: Suivez-nous sur Instagram
ru: Подписывайтесь на нас в Instagram

source: Email us
de: Schreiben Sie uns eine E-Mail
fr: Envoyez-nous un email
ru: Напишите нам

source: Contact
de: Kontakt
ru: Контакты

source: United Kingdom
de: Vereinigtes Königreich
fr: Royaume-Uni
ru: Соединённое Королевство

source: Photography
de: Fotografie
fr: Photographie
ru: Фотография

source: More Photography
de: Weitere Fotografie
fr: Plus de photographies
ru: Ещё фотографии

source: All works © Abu Pashaev
de: Alle Werke © Abu Pashaev
fr: Toutes les œuvres © Abu Pashaev
ru: Все работы © Abu Pashaev

source: Donate
de: Spenden
fr: Faire un don
ru: Пожертвовать

source: Buy me a Coffee
de: Kaufen Sie mir einen Kaffee
fr: Offrez-moi un café
ru: Купите мне кофе

source: Reflected Past Through Time and Space
de: Reflektierte Vergangenheit durch Zeit und Raum
fr: Passé réfléchi à travers le temps et l'espace
ru: Отраженное прошлое сквозь время и пространство

source: Contemplation Through Time and Space
de: Kontemplation durch Zeit und Raum
fr: Contemplation à travers le temps et l'espace
ru: Созерцание сквозь время и пространство

source: Date by the Erzi Towers
de: Verabredung bei den Erzi-Türmen
fr: Rendez-vous près des tours d'Erzi
ru: Свидание у башен Эрзи

source: The Past Reflected in the Present
de: Die Vergangenheit im Jetzt reflektiert
fr: Le passé reflété dans le présent
ru: Прошлое, отраженное в настоящем

source: Interrupted Flight
de: Unterbrochener Flug
fr: Vol interrompu
ru: Прерванный полет

source: Spring
de: Frühling
fr: Printemps
ru: Весна

source: The Tree
de: Der Baum
fr: L'arbre
ru: Дерево

source: Contemplation through Time and Space
de: Kontemplation durch Zeit und Raum
fr: Contemplation à travers le temps et l'espace
ru: Созерцание сквозь время и пространство

source: Variant: Dream in the Jade Pavilion
de: Variante: Traum im Jade-Pavillon
fr: Variante : Rêve dans le pavillon de jade
ru: Вариант: Сон в нефритовом павильоне

source: Inside Metamorphosis
de: In der Metamorphose
fr: À l'intérieur de la métamorphose
ru: Внутри метаморфозы

source: Dream in the Jade Pavilion
de: Traum im Jade-Pavillon
fr: Rêve dans le pavillon de jade
ru: Сон в нефритовом павильоне

source: Illustration for the poem: 'Autumn, the Wind's Breath, Fallen Leaves, Yet Spring Blossoms in My Heart…'
de: Illustration für das Gedicht: 'Herbst, der Atem des Windes, gefallene Blätter, dennoch blüht der Frühling in meinem Herzen…'
fr: Illustration pour le poème : 'Automne, le souffle du vent, feuilles mortes, mais le printemps fleurit dans mon cœur...'
ru: Иллюстрация к поэме: 'Осень, дыхание ветра, опавшие листья, но в моем сердце расцветает весна...'

source: Genealogical tree
de: Stammbaum
fr: Arbre généalogique
ru: Генеалогическое дерево

source: Reflected Past Across Time and Space
de: Reflektierte Vergangenheit durch Zeit und Raum
fr: Passé réfléchi à travers le temps et l'espace
ru: Отраженное прошлое сквозь время и пространство

source: Mirage
de: Fata Morgana
ru: Мираж

source: Transformation of Narcissus and Echo
de: Transformation von Narziss und Echo
fr: Transformation de Narcisse et d'Écho
ru: Преображение Нарцисса и Эхо

source: Time Is Relentless
de: Die Zeit ist unaufhaltsam
fr: Le temps est impitoyable
ru: Время безжалостно

source: Petroglyphs
de: Petroglyphen
fr: Pétroglyphes
ru: Петроглифы

source: Nostalgia Transcending the Phrase of Infinity
de: Nostalgie, die den Begriff der Unendlichkeit überschreitet
fr: Nostalgie transcendante la phrase de l'infini
ru: Ностальгия, превосходящая фразу бесконечности

source: Tree
de: Baum
fr: Arbre
ru: Дерево

source: Past Reflected in the Present
de: Vergangenheit im Jetzt reflektiert
fr: Le passé reflété dans le présent
ru: Прошлое, отраженное в настоящем

source: Rendezvous by the Towers of Erzi
de: Rendezvous bei den Türmen von Erzi
fr: Rendez-vous près des tours d'Erzi
ru: Свидание у башен Эрзи

source: Contemplation Through Time and Space 2
de: Kontemplation durch Zeit und Raum 2
fr: Contemplation à travers le temps et l'espace 2
ru: Созерцание сквозь время и пространство 2

source: Nostalgia Transitioning into the Phase of Infinity
de: Nostalgie, die in die Phase der Unendlichkeit übergeht
fr: Nostalgie passant à la phase de l'infini
ru: Ностальгия, переходящая в фазу бесконечности

source: The Warrior in a Burqa Contemplating Petroglyphs
de: Der Krieger in einer Burka, der Petroglyphen betrachtet
fr: Le guerrier en burqa contemplant les pétroglyphes
ru: Воин в бурке, созерцающий петроглифы

source: Tower
de: Turm
fr: Tour
ru: Башня

source: You and Me
de: Du und Ich
fr: Toi et moi
ru: Ты и я

source: Genealogical Tree
de: Stammbaum
fr: Arbre généalogique
ru: Генеалогическое дерево

source: Dream as if There Were No Tomorrow
de: Träume, als gäbe es kein Morgen
fr: Rêver comme s'il n'y avait pas de lendemain
ru: Мечтай, как будто нет завтра

source: Istang art. fluid execution
de: Istang-Kunst. Flüssige Ausführung
fr: Art istang. exécution fluide
ru: Истанг арт. плавное исполнение

source: Late for Spring
de: Zu spät für den Frühling
fr: En retard pour le printemps
ru: Опоздал на весну

source: Hunt
de: Jagd
fr: Chasse
ru: Охота

source: HOME
de: STARTSEITE
fr: ACCUEIL
ru: ГЛАВНАЯ
