Repository: Pazzword/Django-Painter-sWeb
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, fr, ru

source: Nostalgia is a passing phrase of infinity.
de: Nostalgie ist eine vorübergehende Phase der Unendlichkeit.
fr: La nostalgie est une phrase passagère de l'infini.
ru: Ностальгия, переходящая в фазу бесконечности.

source: Abu Pashaev is a distinguished artist whose life journey shapes his profound creations. From serving in the Soviet Army to graduating in graphic design, Pashaev's diverse experiences manifest in his artwork. Seeking guidance from renowned Chechen artists and integrating martial arts philosophy, he crafted his style, 'Wind.' His graphic series, like 'You Don't Know How Painful It Is!,' explores inner worlds with titles such as 'Scream' and 'Apocalypse.'
de: Abu Pashaev ist ein angesehener Künstler, dessen Lebensweg seine tiefgründigen Werke prägt. Vom Dienst in der Sowjetarmee bis zum Abschluss in Grafikdesign, spiegeln sich Pashaevs vielfältige Erfahrungen in seiner Kunst wider. Unter der Anleitung renommierter tschetschenischer Künstler und der Integration der Kampfkunstphilosophie entwickelte er seinen Stil 'Wind'. Seine Grafikserien, wie 'Du weißt nicht, wie schmerzhaft es ist!', erforschen innere Welten mit Titeln wie 'Schrei' und 'Apokalypse'.
fr: Abu Pashaev est un artiste distingué dont le parcours de vie façonne ses créations profondes. Du service dans l'armée soviétique à l'obtention d'un diplôme en design graphique, les expériences variées de Pashaev se manifestent dans son œuvre. En cherchant l'orientation d'artistes tchétchènes renommés et en intégrant la philosophie des arts martiaux, il a créé son style, 'Vent'. Sa série graphique, comme 'Vous ne savez pas combien c'est douloureux !', explore les mondes intérieurs avec des titres tels que 'Cri' et 'Apocalypse'.
ru: Абу Пашаев - выдающийся художник, чье жизненное путешествие формирует его глубокие творения. От службы в Советской армии до окончания учебы по специальности графический дизайн, разнообразный опыт Пашаева проявляется в его произведениях. Обращаясь за советом к известным чеченским художникам и интегрируя философию боевых искусств, он создал свой стиль, 'Ветер'. Его графические серии, такие как 'Ты не знаешь, как это больно!', исследуют внутренние миры с такими названиями, как 'Крик' и 'Апокалипсис'.

source: An Esoteric Perspective on Ancestral Symbols
de: Eine esoterische Perspektive auf Ahnensymbole
fr: Une perspective ésotérique sur les symboles ancestraux
ru: Эзотерическая перспектива на символы предков

source: Image 1
de: Bild 1

source: Image 2
de: Bild 2

source: Image 3
de: Bild 3

source: Image 4
de: Bild 4

source: Image 5
de: Bild 5

source: Abu Pashaev
ru: Абу Пашаев

source: Email
ru: Электронная почта

source: Goryanka
ru: Горянка

source: Seppuku
ru: Сэппуку
